In [1]:
import pandas as pd
df = pd.read_csv("./data/Wednesday-workingHours.pcap_ISCX.csv")

In [2]:
data = df

In [ ]:
data

In [ ]:
data.head()

In [ ]:
data.columns

In [ ]:
data.info()

In [ ]:
data.shape

(692703, 79)

In [ ]:
data.value_counts()

In [ ]:
data[" Label"].value_counts()

 Label
BENIGN              440031
DoS Hulk            231073
DoS GoldenEye        10293
DoS slowloris         5796
DoS Slowhttptest      5499
Heartbleed              11
Name: count, dtype: int64

# limpieza
hemos visto que pese a no haver valores nulos, hay valores irreales que han de ser limpiados como los valores 'inf' o lo spuertos '0.00'

> AÃ±adir blockquote

In [ ]:
data[data[" Flow Packets/s"]==float("inf")][" Label"].value_counts()

In [ ]:
for n,m in data[[" Flow Packets/s", " Label"]].iterrows():
  if n == float('inf') and m == 'Benign':
    print(n,m)

In [ ]:
data[data[" Flow Packets/s"]==float("inf")][" Label"].value_counts()

In [ ]:
data[data[" Destination Port"]==float("0.00")][" Label"].value_counts()

 Label
BENIGN    330
Name: count, dtype: int64

In [ ]:
for n,m in data[[" Destination Port", " Label"]].iterrows():
  if n == '0.00' and m == 'Benign':
    print(n,m)

# Analisis eda

In [ ]:
data[" Destination Port"].value_counts().head(15)

 Destination Port
80      301422
53      195531
443     100229
123       4293
22        2169
137       1480
389       1136
21        1112
88         932
465        691
139        578
3268       476
0          330
138        326
445        259
Name: count, dtype: int64

In [ ]:
data[" Flow Duration"].value_counts().head(15)

 Flow Duration
3      28970
4      18716
1      12788
2       6067
5       3580
48      2462
49      2234
0       1297
53      1072
191      988
52       982
6        974
54       958
50       954
192      936
Name: count, dtype: int64

In [ ]:
data[" Flow Packets/s"].value_counts().head(15)

 Flow Packets/s
6.666667e+05    28688
5.000000e+05    17126
2.000000e+06    12726
1.000000e+06     5958
4.000000e+05     2348
4.166667e+04     2331
4.081633e+04     1862
7.500000e+05     1820
2.380952e+04     1093
2.409639e+04     1080
2.439024e+04     1049
2.564103e+04     1044
2.352941e+04     1029
2.272727e+04     1028
2.469136e+04     1027
Name: count, dtype: int64